# taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
brew 'caskroom/cask/brew-cask'

# tools
brew 'git'
brew 'mercurial'
brew 'emacs', args: ['with-cocoa']
brew 'vim', args: ['with-lua']
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'imagemagick'
brew 'highlight'
brew 'jq'
brew 'mobile-shell'
brew 'mysql'
brew 'postgresql'
brew 'heroku-toolbelt'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'texinfo' # for emacs-flycheck
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'readline'

# languages
cask 'java'
cask 'java7'
brew 'ocaml'
brew 'opam'
brew 'go'
brew 'erlang'
brew 'gcc'
brew 'ghc'
brew 'python'
brew 'lua'
brew 'node'
brew 'rust'
cask 'cargo'
brew 'scala'
brew 'sbt'
brew 'typesafe-activator'

# casks
cask 'alfred'
cask 'atom'
cask 'bettertouchtool'
cask 'boot2docker'
cask 'copy'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'gifzo'
cask 'gitbook'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'imageoptim'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'kobito'
cask 'lastpass'
cask 'latexit'
cask 'libreoffice'
cask 'lyn'
cask 'mactex'
cask 'omnidisksweeper'
cask 'skim'
cask 'slack'
cask 'sourcetree'
cask 'steam'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
