tap "homebrew/cask"
tap "homebrew/cask-fonts"
brew "bat"
brew "chezmoi"
brew "emacs"
brew "fzf"
brew "git"
brew "git-delta"
brew "sheldon"
brew "starship"
brew "tmux"
brew "vim"
brew "zoxide"
brew "zsh"
cask "alacritty"
cask "font-meslo-lg-nerd-font"
cask "gpg-suite"
